package com.example.random.data

import com.example.random.model.Hero
import com.example.random.model.HeroCombo
//1 to "对抗路", 2 to "中路", 3 to "游走",4 to "打野",5 to "发育路",
//Download the official hero list from `https://pvp.qq.com/web201605/js/herolist.json`
object HeroRepository {
    val heroList = listOf(
        Hero(105, "廉颇", "lianpo", "正义爆轰", 3, 1, 4, "正义爆轰|地狱岩魂|无尽征程|寅虎·御盾|功夫炙烤|撼地雄心", 3627),
        Hero(106, "小乔", "xiaoqiao", "恋之微风", 2, null, null, "恋之微风|万圣前夜|天鹅之梦|纯白花嫁|缤纷独角兽|丁香结|青蛇|音你心动|山海·琳琅生|时之魔女|秘证寻踪", 3644),
        Hero(107, "赵云", "zhaoyun", "苍天翔龙", 4, 1, null, "苍天翔龙|忍●炎影|未来纪元|皇家上将|嘻哈天王|白执事|引擎之心|龙胆|淬星耀世|百木心枪|乘龙铭钟鼎", 3661),
        Hero(108, "墨子", "mozi", "和平守望", 3, 2, 1, "和平守望|金属风暴|龙骑士|进击墨子号|神迹守卫|降魔|黄金天蝎座", 3547),
        Hero(109, "妲己", "daji", "魅力之狐", 2, null, 3, "魅惑之狐|女仆咖啡|魅力维加斯|仙境爱丽丝|少女阿狸|热情桑巴|时之彼端|紫罗兰之誓|时之奇旅|青丘·九尾|灵卜魔法|愿照·众生和", 3663),
        Hero(110, "嬴政", "yingzheng", "王者独尊", 2, null, null, "王者独尊|摇滚巨星|暗夜贵公子|优雅恋人|白昼王子|玄雷天君", 3680),
        Hero(111, "孙尚香", "sunshangxiang", "千金重弩", 5, null, null, "千金重弩|火炮千金|水果甜心|蔷薇恋人|杀手不太冷|末日机甲|沉稳之力|时之恋人|异界灵契|音你闪耀|乘龙问璇玑", 3577),
        Hero(112, "鲁班七号", "lubanqihao", "机关造物", 5, null, null, "机关造物|木偶奇遇记|福禄兄弟|电玩小子|星空梦想|狮舞东方|黑桃队长|乒乒小将|寅虎·瑞焰|时之奇旅|蔬乡物语|江户川柯南", 3697),
        Hero(113, "庄周", "zhuangzhou", "逍遥梦幻", 3, 1, 4, "逍遥幻梦|鲤鱼之梦|蜃楼王|云端筑梦师|奇妙博物学|玄嵩|高山流水|天秀·幻梦|牧神诗旅|锦麟游梦", 3594),
        Hero(114, "刘禅", "liushan", "暴走机关", 3, 1, null, "暴走机关|英喵野望|绅士熊喵|天才门将|秘密基地|唤灵魔甲|电玩·爆裂旋风|鸭鸭历险记", 3714),
        Hero(115, "高渐离", "gaojianli", "叛逆吟游", 2, null, null, "叛逆吟游|金属狂潮|死亡摇滚|玩趣恶龙|天秀·音浪|燃音魔法", 3611),
        Hero(116, "阿轲", "ake", "信念之刃", 4, null, null, "信念之刃|爱心护理|暗夜猫娘|致命风华|节奏热浪|迷踪丽影|化蝶舞", 3731),
        Hero(117, "钟无艳", "zhongwuyan", "野蛮之锤", 1, 4, null, "野蛮之锤|生化警戒|王者之锤|海滩丽影|超时空战士|聚星闪耀|春野之旅|戍鼓铭心|戍鼓铭心", 3628),
        Hero(118, "孙膑", "sunbin", "逆流之时", 3, null, null, "逆流之时|未来旅行|天使之翼|妖精王|归虚梦演|天狼运算者|寅虎·展翼|小动物乐团|茶境仙", 3645),
        Hero(119, "扁鹊", "bianque", "善恶怪医", 2, 5, null, "善恶怪医|救世之瞳|化身博士|炼金王|奇幻香踪|无尽旅途|灵蛊蚀心", 3662),
        Hero(120, "白起", "baiqi", "最终兵器", 1, 3, null, "最终兵器|白色死神|狰|星夜王子|夜都怪侠|乐园追猎者|苍鳞隐世|死霸装", 3679),
        Hero(121, "芈月", "miyue", "永恒之月", 1, 4, null, "永恒之月|红桃皇后|大秦宣太后|重明|白晶晶|幻夜卜梦|浮光幕影|瑰影绮梦", 3696),
        Hero(123, "吕布", "lvbu", "无双之魔", 1, null, 3, "无双之魔|圣诞狂欢|天魔缭乱|末日机甲|猎兽之王|野性能量|御风骁将|怒海麟威|遇见神鼓|曦玄引|逐霄战戟", 3713),
        Hero(124, "周瑜", "zhouyv", "铁血都督", 2, null, null, "铁血都督|海军大将|真爱至上|赤莲之焰|音你心动|雪夜绮愿|熔金海岸|百相守梦", 3784),
        Hero(126, "夏侯惇", "xiahoudun", "不羁之风", 1, 4, 3, "不羁之风|战争骑士|乘风破浪|无限飓风号|朔风刀|匿光决锋者|霜北刀", 3730),
        Hero(127, "甄姬", "zhenji", "洛神降临", 2, null, 3, "洛神降临|冰雪圆舞曲|花好人间|游园惊梦|幽恒|女儿国国王|落雪兰心|至美·化雀舞|雪境奇遇|逆浪荇歌", 3747),
        Hero(128, "曹操", "caocao", "鲜血枭雄", 1, 4, null, "鲜血枭雄|超能战警|幽灵船长|死神来了|烛龙|天狼征服者|决胜大满贯", 3765),
        Hero(129, "典韦", "dianwei", "狂战士", 4, 1, null, "狂战士|黄金武士|穷奇|蓝屏警告|岱宗|铁甲之心|战鼓燎原|铁骨偃魂", 3782),
        Hero(130, "宫本武藏", "gongbenwuzang", "剑圣", 4, 1, null, "剑圣|鬼剑武藏|未来纪元|万象初新|地狱之眼|霸王丸|惊梅引|黑崎一护", 3799),
        Hero(131, "李白", "libai", "青莲剑仙", 4, null, 1, "青莲剑仙|范海辛|千年之狐|凤求凰|敏锐之力|鸣剑·曳影|诗剑行|碎月剑心|谪仙醉月", 3816),
        Hero(132, "马可波罗", "makeboluo", "远游之枪", 5, null, null, "远游之枪|激情绿茵|逐梦之星|暗影游猎|潮玩牛仔|深海之息|山海·玄木吟|妄想实况|星界特工|怪盗基德", 3764),
        Hero(133, "狄仁杰", "direnjie", "断案大师", 5, null, null, "断案大师|锦衣卫|魔术师|超时空战士|阴阳师|鹰眼统帅|万华元夜|星际治安官|神器·狴犴令|绮世丹青", 3781),
        Hero(134, "达摩", "damo", "拳僧", 1, 4, null, "拳僧|拳王|大发明家|黄金狮子座|星际陆战队|沙漠行僧|爆烈喵拳", 3798),
        Hero(135, "项羽", "xiangyu", "霸王", 1, 3, null, "霸王|帝国元帅|苍穹之光|海滩派对|职棒王牌|霸王别姬|科学大爆炸|无限倾心|苍威无极", 3815),
        Hero(136, "武则天", "wuzetian", "女帝", 2, 3, null, "女帝|东方不败|海洋之心|倪克斯神谕|神器·明辉仪", 3832),
        Hero(139, "老夫子", "laofuzi", "万古长明", 1, null, null, "万古长明|潮流仙人|圣诞老人|功夫老勺|醍醐杖|航海奇遇记|百相守梦|藏狐·褐绒", 3849),
        Hero(140, "关羽", "guanyu", "一骑当千", 1, 3, null, "一骑当千|龙腾万里|天启骑士|冰锋战神|武圣|赤影疾锋|百相守梦|决胜骁骑", 3866),
        Hero(141, "貂蝉", "diaochan", "绝世舞姬", 2, 1, null, "绝世舞姬|异域舞娘|圣诞恋歌|仲夏夜之梦|逐梦之音|猫影幻舞|遇见胡旋|唤灵魅影|幻阙歌|曦玄引|长夏之忆|馥梦繁花", 3883),
        Hero(142, "安琪拉", "anqila", "暗夜萝莉", 2, null, null, "暗夜萝莉|玩偶对对碰|魔法小厨娘|心灵骇客|如懿|时之奇旅|追逃游戏|乘龙聚宝船|酷洛米之心", 3900),
        Hero(144, "程咬金", "chengyaojin", "热烈之斧", 1, 4, null, "热烈之斧|爱与正义|星际陆战队|华尔街大亨|功夫厨神|活力突击|演武夺筹|无双福将|暖冬絮语|群星魔术团", 3917),
        Hero(146, "露娜", "luna", "月光之女", 4, 2, null, "月光之女|哥特玫瑰|绯红之刃|紫霞仙子|一生所爱|瓷语鉴心|启示之音|霜月吟|命运加冕", 3934),
        Hero(148, "姜子牙", "jiangziya", "封神者", 2, 3, 4, "太古魔导|时尚教父|炽热元素使|闲日渔趣|天穹之誓|星梦巡礼", 3951),
        Hero(149, "刘邦", "liubang", "双面君主", 1, 3, null, "双面君主|圣殿之光|德古拉伯爵|夺宝奇兵|虎啸剑宗|剑破天穹", 3978),
        Hero(150, "韩信", "hanxin", "国士无双", 4, null, null, "国士无双|街头霸王|教廷特使|白龙吟|逐梦之影|飞衡|傲雪梅枪|弑枪猎影|群星魔术团", 3985),
        Hero(152, "王昭君", "wangzhaojun", "冰雪之华", 2, 3, null, "冰雪之华|精灵公主|偶像歌手|凤凰于飞|幻想奇妙夜|乞巧织情|午后时光|星穹之声|映山客", 4002),
        Hero(153, "兰陵王", "lanlingwang", "暗影刀锋", 4, 1, 3, "暗影刀锋|隐刃|暗隐猎兽者|驯魔猎人|默契交锋|金庭之子|影龙天霄", 4019),
        Hero(154, "花木兰", "huamulan", "传说之刃", 1, null, 4, "传说之刃|剑舞者|兔女郎|水晶猎龙者|青春决赛季|冠军飞将|瑞麟志|默契交锋|九霄神辉|燃星之曲", 4036),
        Hero(156, "张良", "zhangliang", "言灵之书", 2, 3, null, "言灵之书|天堂福音|一千零一夜|幽兰居士|黄金白羊座|缤纷绘卷|千筹问战|古海寻踪|灵野札记", 4053),
        Hero(157, "不知火舞", "buzhihuowu", "明媚烈焰", 2, null , null, "明媚烈焰|魅语|绯月行|花合斗", 4070),
        Hero(162, "娜可露露", "nakelulu", "鹰之守护", 4, null, null, "鹰之守护|晚萤|前尘镜", 4087),
        Hero(163, "橘右京", "jvyoujing", "神梦一刀", 4, 1, null, "神梦一刀|修罗|枫霜尽", 4104),
        Hero(166, "亚瑟", "yase", "圣骑之力", 1, 4, null, "圣骑之力|死亡骑士|狮心王|心灵战警|潮玩骑士王|追逃游戏|鸿运当头|动物派对|布丁狗之誓", 4121),
        Hero(167, "孙悟空", "sunwukong", "齐天大圣", 4, null, null, "齐天大圣|地狱火|西部大镖客|美猴王|至尊宝|全息碎影|大圣娶亲|零号·赤焰|孙行者|齐天大圣|神迹守卫", 4138),
        Hero(168, "牛魔", "niumo", "精英酋长", 3, null, null, "精英酋长|西部大镖客|制霸全明星|御旌|奔雷神使|牛运亨通|星界战将|小牛鸭", 4155),
        Hero(169, "后羿", "houyi", "半神之弓", 5, null, null, "半神之弓|精灵王|阿尔法小队|辉光之辰|黄金射手座|如梦令|圣弓游侠|无尽星芒|完美运算|石田雨龙", 4172),
        Hero(170, "刘备", "liubei", "仁德义枪", 4, null, 1, "仁德义枪|万事如意|纽约教父|汉昭烈帝|时之恋人|潮玩造梦师|百相守梦|异域游侠|浪漫序章", 4189),
        Hero(171, "张飞", "zhangfei", "禁血狂兽", 3, null, null, "禁血狂兽|五福同心|乱世虎臣|虎魂|百相守梦|兔狲·蓬尾", 4206),
        Hero(173, "李元芳", "liyuanfang", "王都密探", 5, 4, null, "王都密探|特种部队|黑猫爱糖果|逐浪之夏|银河之约|飞鸢探春|云中旅人|妄想特派|匿光侦查者|蔬乡物语", 4223),
        Hero(174, "虞姬", "yuji", "森之风灵", 5, null, null, "森之风灵|加勒比小姐|霸王别姬|凯尔特女王|云霓雀翎|启明星使|无限倾心|神鉴启示录|夏日便利店|愿照·岁时盈", 4240),
        Hero(175, "钟馗", "zhongkui", "虚灵城判", 3, null, null, "虚灵城判|地府判官|神迹守卫|驱傩正仪|乐园奇幻夜|虚灵犬护", 4257),
        Hero(178, "杨戬", "yangjian", "根源之目", 4, 1, null, "根源之目|埃及法老|永曜之星|次元傲视|天秀·启明|潮玩骑兵|破阵·退雄兵", 4291),
        Hero(183, "雅典娜", "yadianna", "圣域余晖", 4, 1, null, "圣域余晖|战争女神|冰冠公主|神奇女侠|单词大作战|黎明之约|潮玩士官长", 4308),
        Hero(184, "蔡文姬", "caiwenji", "天籁弦音", 3, null, null, "天籁弦音|蔷薇王座|奇迹圣诞|舞动绿茵|繁星吟游|花朝如约|电玩·兔顽号|夏日便利店|愿照·福禄聚", 4325),
        Hero(186, "太乙真人", "taiyizhenren", "炼金大师", 3, 2, null, "炼金大师|圆桌骑士|饕餮|华丽摇滚|劲辣红锅|谧流熔炉", 4342),
        Hero(180, "哪吒", "nezha", "桀骜炎枪", 4, 1, 2, "桀骜炎枪|三太子|逐梦之翼|次元突破|雪上飞焰|热血海滩", 4359),
        Hero(190, "诸葛亮", "zhugeliang", "绝代智谋", 2, 4, null, "绝代智谋|星航指挥官|黄金分割率|武陵仙君|掌控之力|时雨天司|星域神启|鹤羽星尊|天机白泽", 4376),
        Hero(192, "黄忠", "huangzhong", "燃魂重炮", 5, null, null, "燃魂重炮|芝加哥教父|烈魂|火炮绅士|怒海冲锋", 4393),
        Hero(191, "大乔", "daqiao", "沧海之曜", 3, 2, null, "沧海之曜|伊势巫女|守护之力|猫狗日记|白蛇|白鹤梁神女|挚爱花嫁|时之奇旅|乘龙忆丹青|绒语心约", 4410),
        Hero(187, "东皇太一", "donghuangtaiyi", "噬灭日蚀", 3, 1, null, "噬灭日蚀|东海龙王|逐梦之光|灼幽烈阳|噬灭天穹|金福满堂", 4427),
        Hero(182, "干将莫邪", "ganjiangmoye", "淬命双剑", 2, null, null, "淬命双剑|第七人偶|冰霜恋舞曲|久胜战神|真爱魔法|胡桃夹子|画中仙|雾都夜雨|千山共赴", 4444),
        Hero(189, "鬼谷子", "guiguzi", "万物有灵", 3, null, null, "万物有灵|阿摩司公爵|幻乐之宴|原初探秘者|五谷丰年|天穹祈灯|克喵", 4461),
        Hero(193, "铠", "kai", "破灭刃锋", 4, 1, null, "破灭刃锋|龙域领主|曙光守护者|青龙志|绛天战甲|银白咏叹调|琥珀纪元|冥王哈迪斯", 3564),
        Hero(196, "百里守约", "bailishouyue", "静谧之眼", 5, null, null, "静谧之眼|绝影神枪|特工魅影|朱雀志|碎云|真我赫兹|雪豹·霜爪", 4478),
        Hero(195, "百里玄策", "bailixuance", "嚣狂之镰", 4, null, null, "嚣狂之镰|威尼斯狂欢|白虎志|原初追逐者|热力回旋|超元猎域|百相守梦", 4495),
        Hero(194, "苏烈", "sulie", "不屈铁壁", 3, 1, null, "不屈铁壁|爱与和平|坚韧之力|玄武志|千军破阵|春野闲踪", 4521),
        Hero(198, "梦奇", "mengqi", "入梦之灵", 4, 1, null, "入梦之灵|美梦成真|胖达荣荣|天降福星|顽趣", 4529),
        Hero(179, "女娲", "nvwa", "至高创世", 2, null, 3, "至高创世|尼罗河女神|朔望之晖|补天|愿照·千秋盛", 4546),
        Hero(501, "明世隐", "mingshiyin", "灵魂劫卜", 3, null, null, "灵魂劫卜|占星术士|虹云星官|疑决卦|吟游魔法|夜落电台|景韶洛都", 4563),
        Hero(199, "公孙离", "gongsunli", "幻舞玲珑", 5, null, null, "幻舞玲珑|花间舞|蜜橘之夏|无限星赏官|祈雪灵祝|玉兔公主|记忆之芯|离恨烟|云诺千山|涂山容容", 4580),
        Hero(176, "杨玉环", "yangyuhuan", "霓裳风华", 2, 3, 4, "风华霓裳|霓裳曲|遇见飞天|寅虎·心曲|银翎春语", 4597),
        Hero(502, "裴擒虎", "peiqinhu", "六合虎拳", 4, null, null, "六合虎拳|街头霸王|梅西|天狼狩猎者|李小龙|寅虎·赤拳|擒涛扼浪|祥瑞亨通", 3581),
        Hero(197, "弈星", "yixing", "天元之弈", 2, null, 5, "天元之弈|踏雪寻梅|混沌棋|滕王阁序|炽奕燎原|万物之道|守夜人", 3598),
        Hero(503, "狂铁", "kuangtie", "战车意志", 1, null, null, "战车意志|命运角斗场|御狮|特工战影|电玩高手|龙之律动", 3615),
        Hero(504, "米莱狄", "milaidi", "筑城者", 2, null, null, "筑城者|精准探案法|御霄|胡桃异想国|契约魔法|完美假期|怪诞之夜", 3632),
        Hero(125, "元歌", "yuange", "无间傀儡", 1, 5, null, "无间傀儡|午夜歌剧院|云间偶戏|无心|诡秘之主", 3649),
        Hero(510, "孙策", "sunce", "光明之海", 1, 4, 3, "光明之海|海之征途|猫狗日记|末日机甲|挚爱之约|乘龙淬吴钩|时之奇旅|百相守梦", 3666),
        Hero(137, "司马懿", "simayi", "寂灭之心", 4, 2, null, "寂灭之心|魇语军师|暗渊魔法|九山相柳", 3683),
        Hero(509, "盾山", "dunshan", "无尽之盾", 3, null, null, "无尽之盾|极冰防御线|御銮|圆桌骑士|梦圆繁星", 3700),
        Hero(508, "伽罗", "jialuo", "破魔之箭", 5, null, null, "破魔之箭|花见巫女|箭羽风息|太华|天狼溯光者|炽翼辉光|琥珀纪元", 3717),
        Hero(312, "沈梦溪", "shenmengxi", "爆弹怪猫", 2, null, null, "爆弹怪猫|棒球奇才|鲨炮海盗猫|星空之诺|月团寄思|大漠名商|匿光破解者|龙舞盛年|鸭鸭历险记", 3734),
        Hero(507, "李信", "lixin", "谋世之战", 1, 5, 4, "谋世之战|灼热之刃|一念神魔|山海·炽霜斩", 3751),
        Hero(513, "上官婉儿", "shangguanwaner", "惊鸿之笔", 2, null, null, "惊鸿之笔|修竹墨客|梁祝|天狼绘梦者|神器·万象笔|妄想奇谈|群星魔术团", 4614),
        Hero(515, "嫦娥", "change", "寒月公主", 2, 1, 4, "寒月公主|露花倒影|如梦令|拒霜思|暖冬·兔眠|漠中幻影", 4631),
        Hero(511, "猪八戒", "zhubajie", "无忧猛士", 4, 1, null, "无忧猛士|年年有余|西部大镖客|猪悟能|潮玩探月行", 4648),
        Hero(529, "盘古", "pangu", "破晓之神", 4, 1, null, "破晓之神|创世神祝|重装意志|冰霜神祇|经纬探寻者|敬我三分", 4665),
        Hero(505, "瑶", "yao", "鹿灵守心", 3, null, null, "鹿灵守心|森|遇见神鹿|时之祈愿|时之愿境|山海·碧波行|真我赫兹|拾光映像|大耳狗之梦", 4682),
        Hero(506, "云中君", "yunzhongjun", "流云之翼", 4, null, null, "流云之翼|荷鲁斯之眼|纤云弄巧|时之祈愿|群星魔术团", 4699),
        Hero(522, "曜", "dongfangyao", "星辰之子", 4, 1, null, "星辰之子|归虚梦演|云鹰飞将|李逍遥|海·苍雷引", 4716),
        Hero(518, "马超", "machao", "冷晖之枪", 1, 4, null, "冷晖之枪|幸存者|神威|无双飞将|琥珀纪元|访茗客", 433),
        Hero(523, "西施", "xishi", "幻纱之灵", 2, 3, null, "幻纱之灵|归虚梦演|诗语江南|游龙清影|玲珑珍味|至美·乘鲤谣|雪境奇遇|续相思|织梦人", 4750),
        Hero(525, "鲁班大师", "lubandashi", "神匠", 3, null, null, "神匠|归虚梦演|乓乓大师|匿光启智者|探海日志", 3768),
        Hero(524, "蒙犽", "mengya", "烈炮小子", 5, null, null, "烈炮小子|归虚梦演|狂想玩偶喵|龙鼓争鸣|胡桃狂想曲|百解令|顽岩魄", 4767),
        Hero(531, "镜", "jing", "破镜之刃", 4, null, null, "破镜之刃|冰刃幻境|炽阳神光|匿光追影者|玫瑰异探|真我赫兹|青焰无极", 4784),
        Hero(527, "蒙恬", "mengtian", "秩序统将", 1, null, null, "秩序统将|秩序猎龙将|蔚蓝守将|荣光圣徽", 4801),
        Hero(533, "阿古朵", "aguduo", "山林之子", 4, 5, null, "山林之子|熊喵少女|顽趣|江河有灵|布丁狗之约", 3785),
        Hero(536, "夏洛特", "xialuote", "玫瑰剑士", 1, null, null, "玫瑰剑士|永昼|浮生妄", 3802),
        Hero(528, "澜", "lan", "鲨之猎刃", 4, null, null, "鲨之猎刃|孤猎|赏金猎手|电玩·雷克斯|逐花归海|愿照·九州拓", 3819),
        Hero(537, "司空震", "sikongzhen", "雷霆之王", 1, 5, null, "雷霆之王|启蛰|地狱燃心|愿照·山河定", 3836),
        Hero(155, "艾琳", "ailin", "精灵之舞", 5, null, null, "精灵之舞|女武神|陌上桑", 3853),
        Hero(538, "云缨", "yunying", "燎原之心", 4, null, null, "燎原之心|赤焰之缨|鹤归松栖|幻光神枪|赞萌露比", 3870),
        Hero(540, "金蝉", "jinchan", "渡世行者", 2, 3, null, "渡世行者|前尘|唐三藏", 3887),
        Hero(542, "暃", "fei", "玉城之子", 4, null, null, "玉城之子|碧珀绯影|星界游侠|埋骨钱|朽木白哉", 4818),
        Hero(534, "桑启", "sangqi", "萤火之旅", 3, null, null, "萤火之旅|画中游|海盐诗旅|奇遇星旅|鸣野蒿", 4835),
        Hero(548, "戈娅", "geya", "沙海飞舟", 5, null, null, "沙海飞舟|危途狂花|驭风魔法|玫蓝誓约", 4852),
        Hero(521, "海月", "haiyue", "永夜之心", 2, null, null, "永夜之心|幻泉雾影|浮梦罗烟|王牌新星|金乌负日", 4937),
        Hero(544, "赵怀真", "zhaohuaizhen", "自在之心", 4, 1, 3, "自在之心|太极少年|鹤归松栖", 5122),
        Hero(545, "莱西奥", "laixiao", "火鹰船长", 5, null, null, "火鹰船长|西部游侠|末日机甲|踏浪烽翎", 5138),
        Hero(564, "姬小满", "jixiaoman", "武道奇才", 1, null, null, "武道奇才|零食大作战|妄想食味|战舞者|飞车小橘子|小满鸭", 5753),
        Hero(514, "亚连", "yalian", "追忆之刃", 1, null, null, "追忆之刃|破局者|落雪白狼|破空之剑", 5560),
        Hero(159, "朵莉亚", "duoliya", "人鱼之歌", 3, null, null, "人鱼之歌|金色潮汐|心动手记|幻珠鲛人", 6177),
        Hero(563, "海诺", "hainuo", "命运之引", 2, 1, null, "命运之引|时空谍影|心动手记", 6387),
        Hero(519, "敖隐", "aoyin", "凌霄真龙", 5, null, 3, "凌霄真龙", 6367),
        Hero(517, "大司命", "dasiming", "肃归之戈", 4, 1, null, "肃归之戈|暗都幽影|东方月初|死亡执政官", 6836),
        Hero(582, "元流之子(法师)", "yuanliuzhizi_magic", "万妙之心", 2, null, null, "万妙之心", 7211),
        Hero(581, "元流之子(坦克)", "yuanliuzhizi_tank", "止戈之道", 1, 3, 4, "止戈之道", 7194),
        Hero(577, "少司缘", "shaosiyuan", "聆愿之祝", 3, null, null, "聆愿之祝|涂山红红|灵卦秘语", 7513),
        Hero(558, "影", "ying", "黯羽东君", 1, 4, null, "黯羽东君|魅影绮裳", 8554),
        Hero(177, "苍", "cang", "苍狼末裔", 5, null, null, "苍狼末裔|维京掠夺者|苍林狼骑", 4274),
        Hero(550, "空空儿", "kongkonger", "笑面诡手", 3, null, null, "笑面诡手|戏梦巡演", 8693),
        Hero(584, "元流之子(射手)", "yuanliuzhizi_archer", "沉舟之志", 5, null, null, "沉舟之志", 8744),
        Hero(151, "孙权", "sunquan", "定旌之谋", 5, null, 1, "定旌之谋", 7004),
        Hero(172, "蚩奼", "chicha", "五兵之主", 1, 4, 5, "五兵之主|极光幻客", 7123),
        Hero(585, "元流之子(辅助)", "yuanliuzhizi_support", "守望之诺", 3, null, null, "守望之诺", 8820),
        Hero(188, "大禹", "dayu", "鼎镇山河", 3, null, null, "鼎镇山河", 9389),
        Hero(583, "元流之子(刺客)", "yuanliuzhizi_assassin", "破局之识", 4, 1, null, "破局之识", 9132)
    )
    
    val heroCombos = listOf(
        HeroCombo(
            name = "长城守卫军",
            heroIds = listOf(154, 193, 196, 195, 194), // 花木兰、铠、百里守约、百里玄策、苏烈
            minRequired = 3,
            borderColor = "#4A90E2" // 蓝色边框
        ),
        HeroCombo(
            name = "五虎上将",
            heroIds = listOf(140, 171, 107, 518, 192), // 关羽、张飞、赵云、马超、黄忠
            minRequired = 3,
            borderColor = "#C41E3A" // 红色边框
        ),
        HeroCombo(
            name = "陨落的天才",
            heroIds = listOf(544, 538), //赵怀真、云缨
            minRequired = 2,
            borderColor = "#FF69B4" // 粉色边框
        ),
        HeroCombo(
            name = "宗教胜利",
            heroIds = listOf(108,537,141,531,518,523), //墨子、貂蝉、司空震、镜、马超、西施
            minRequired = 4,
            borderColor = "#4A90E2"
        ),
        HeroCombo(
            name = "哈~",
            heroIds = listOf(502,312), //裴擒虎、沈梦溪
            minRequired = 2,
            borderColor = "#FFD700"
        ),
         HeroCombo(
            name = "马，瑶",
            heroIds = listOf(132,505), //马可波罗、瑶
            minRequired = 2,
            borderColor = "#FFD700"
        ),
        HeroCombo(
            name = "三分天下",
            heroIds = listOf(170,128,151,510), //刘备、曹操、孙权、孙策
            minRequired = 3,
            borderColor = "#FFD700"
        ),

    )
    
    fun getHeroAvatarUrl(ename: Int): String {
        return "https://game.gtimg.cn/images/yxzj/img201606/heroimg/$ename/$ename.jpg"
    }
}
